In [1]:
import pandas as pd
import numpy as np

# Read the three files into python as dataframes

In [2]:
df_file1 = pd.read_csv("C:/Users/ruben/OneDrive/Área de Trabalho/IRONHACK/Week 1/Week 1/Day 2/lab-customer-analysis-round-1/files_for_lab/csv_files/file1.csv")
df_file2 = pd.read_csv("C:/Users/ruben/OneDrive/Área de Trabalho/IRONHACK/Week 1/Week 1/Day 2/lab-customer-analysis-round-1/files_for_lab/csv_files/file2.csv")
df_file3 = pd.read_csv("C:/Users/ruben/OneDrive/Área de Trabalho/IRONHACK/Week 1/Week 1/Day 2/lab-customer-analysis-round-1/files_for_lab/csv_files/file3.csv")

# Show the DataFrame's shape.

In [3]:
print(df_file1.shape, df_file2.shape, df_file3.shape)

(4008, 11) (996, 11) (7070, 11)

# Standardize header names.

In [4]:
# After inspecting the heads of the three dataframes I decided to select the list of columns names of df_file3 as the standard:

print(list(df_file3.columns))

different_df1 = []
different_df2 = []

for col_name in list(df_file1.columns):
    if col_name not in list(df_file3.columns):
        different_df1.append(col_name)
        
for col_name in list(df_file2.columns):
    if col_name not in list(df_file3.columns):
        different_df2.append(col_name)

df_file2=df_file2.rename(columns={ 'ST':'State','GENDER':'Gender'})
df_file1=df_file1.rename(columns={ 'ST':'State','GENDER':'Gender'})

['Customer', 'State', 'Customer Lifetime Value', 'Education', 'Gender', 'Income', 'Monthly Premium Auto', 'Number of Open Complaints', 'Policy Type', 'Total Claim Amount', 'Vehicle Class']

# Rearrange the columns in the dataframe as needed

In [5]:
# Can reorder by the first df:

print(list(df_file1.columns))

df_file2=df_file2[list(df_file1.columns)]
df_file3=df_file3[list(df_file1.columns)]

['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value', 'Income', 'Monthly Premium Auto', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class', 'Total Claim Amount']

# Concatenate the three dataframes

In [6]:
combined_df = pd.concat([df_file1, df_file2, df_file3], axis=0)
print(combined_df.shape)

combined_df.head()

(12074, 11)

,Customer,State,Gender,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,Bachelor,764586.18%,0.0,106.0,1/0/00,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,High School or Below,536307.65%,36357.0,68.0,1/0/00,Personal Auto,Four-Door Car,17.269323

# Which columns are numerical?

# Which columns are categorical?

In [7]:
categorical = print(list(combined_df.select_dtypes("object")))

numerical = print(list(combined_df.select_dtypes(np.number)))

['Customer', 'State', 'Gender', 'Education', 'Customer Lifetime Value', 'Number of Open Complaints', 'Policy Type', 'Vehicle Class']
['Income', 'Monthly Premium Auto', 'Total Claim Amount']

# Understand the meaning of all columns

In [8]:
# I believe this means to have an idea about NAs.

combined_df.isna()
print(combined_df.isna().sum()) # according to the shape it has 12074 rows, so roughly for each category 1/4 of the values are NAs

print(round(combined_df.isna().sum()/len(combined_df),4)*100)

# Resume in a new Dataframe

nulls_df = pd.DataFrame(round(combined_df.isna().sum()/len(combined_df),4)*100)
nulls_df.head()

Customer                     2937
State                        2937
Gender                       3059
Education                    2937
Customer Lifetime Value      2944
Income                       2937
Monthly Premium Auto         2937
Number of Open Complaints    2937
Policy Type                  2937
Vehicle Class                2937
Total Claim Amount           2937
dtype: int64
Customer                     24.32
State                        24.32
Gender                       25.34
Education                    24.32
Customer Lifetime Value      24.38
Income                       24.32
Monthly Premium Auto         24.32
Number of Open Complaints    24.32
Policy Type                  24.32
Vehicle Class                24.32
Total Claim Amount           24.32
dtype: float64

                             0
Customer                 24.32
State                    24.32
Gender                   25.34
Education                24.32
Customer Lifetime Value  24.38

# Perform the data cleaning operations mentioned so far in class:

### Delete the column education and the number of open complaints from the dataframe.

In [9]:
# Can also remove duplicates, not necessarily related to the exercise

new_df=combined_df.drop_duplicates()
print(new_df.shape)

new_df.drop(columns="Education", inplace=True)
new_df.drop(columns="Number of Open Complaints", inplace=True)

print(new_df.shape)

(9135, 11)
(9135, 9)

C:\Users\ruben\anaconda3\lib\site-packages\pandas\core\frame.py:4163: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  return super().drop(

### Correct the values in the column customer lifetime value. They are given as a percent, so multiply them by 100 and change dtype to numerical type.

In [10]:
# p= new_df["Customer Lifetime Value"].fillna("%")

new_df2 = new_df["Customer Lifetime Value"].str.rstrip('%').astype(np.number)*100.0

new_df["Customer Lifetime Value"]=new_df2
new_df

<ipython-input-10-b4c0bb23ee07>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_df["Customer Lifetime Value"]=new_df2

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,128874317.0,48767.0,108.0,Personal Auto,Two-Door Car,566.472247
3,WW63253,California,M,76458618.0,0.0,106.0,Corporate Auto,SUV,529.881344
4,GA49547,Washington,M,53630765.0,36357.0,68.0,Personal Auto,Four-Door Car,17.269323
...,...,...,...,...,...,...,...,...,...
7065,LA72316,California,M,NaN,71941.0,73.0,Personal Auto,Four-Door Car,198.234764
7066,PK87824,California,F,NaN,21604.0,79.0,Corporate Auto,Four-Door Car,379.200000
7067,TD14365,California,M,NaN,0.0,85.0,Corporate Auto,Four-Door Car,790.784983
7068,UP19263,California,M,NaN,21941.0,96.0,Personal Auto,Four-Door Car,691.200000
7069,Y167826,California,M,NaN,0.0,77.0,Corporate Auto,Two-Door Car,369.600000

### Check for duplicate rows in the data and remove if any.

In [11]:
# Already addresses before - see "Delete the column education and the number of open complaints from the dataframe."

new_df=new_df.drop_duplicates()

### Filter out the data for customers who have an income of 0 or less.

In [12]:
# Is there a typo? income of 0 or less

filtered = new_df[new_df['Income']<=0]
filtered.head()

,Customer,State,Gender,Customer Lifetime Value,Income,Monthly Premium Auto,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,NaN,0.0,1000.0,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,69795359.0,0.0,94.0,Personal Auto,Four-Door Car,1131.464935
3,WW63253,California,M,76458618.0,0.0,106.0,Corporate Auto,SUV,529.881344
7,CF85061,Arizona,M,72161003.0,0.0,101.0,Corporate Auto,Four-Door Car,363.029680
10,SX51350,California,M,47389920.0,0.0,67.0,Personal Auto,Four-Door Car,482.400000